import numpy as np
import matplotlib.pyplot as plt

# ===== 例データ（各条件ごとに生データを入れる）=====
data = {
    0:   np.array([ 98.43950025, 124.22207326, 129.46087981, 117.84704776, 127.48470047,
 111.82929221, 105.00400814, 102.38061594, 115.10710641,  77.81960424,
  98.43950025, 126.59565843, 130.09403804, 105.00400814, 125.20262319,
 125.20262319, 115.54203475, 117.02230875, 116.60808214, 111.88566888,
 116.60808214,  66.99834532,  66.99834532,  77.81960424,  88.83138806,
  88.83138806,  75.89488394,  75.89488394, 102.38061594,]),
    10:  np.array([131.2115733,  187.22284929, 136.77668844, 136.77668844, 196.42456723,
 181.99710539, 112.99850466, 113.40285944, 112.68109892, 112.99850466,
 131.2115733,  174.16267989, 125.40577289, 112.68109892, 113.40285944,]),
    20:  np.array([131.5622538,  115.8371685,  115.8371685,  182.80434355, 131.5622538,
 195.27201681, 177.05527506, 136.43602248, 117.8032526,  136.43602248,
 117.8032526, 145.42252809, 171.03409291,]),
    30:  np.array([118.13781468, 118.13781468, 183.24505324, 187.86158373, 117.52177351,
 154.6628921,  207.74232251, 117.52177351, 208.35131848, 154.6628921,]),
    40: np.array([245.31622937, 231.04751185, 190.56015067, 131.35656845, 131.35656845,
 245.31622937,])
}

x_vals = []
means = []
stds = []

plt.figure(figsize=(5,4))

bar_width = 2  # 左にずらす量（見た目調整）

for x, vals in data.items():
    vals = np.array(vals)

    # ===== 生データ（左側に縦に並べる）=====
    if len(vals) > 0:
        plt.scatter(
            np.full(len(vals), x - bar_width),
            vals,
            color='black',
            s=20,
            alpha=0.8
        )

        # mean / SD
        mean = np.mean(vals)
        std = np.std(vals, ddof=1)

        x_vals.append(x)
        means.append(mean)
        stds.append(std)

# ===== 平均（棒グラフ）=====
plt.bar(
    x_vals,
    means,
    width=2,
    color='lightgray',
    edgecolor='black',
    linewidth=1.5,
    zorder=1
)

# ===== エラーバー =====
plt.errorbar(
    x_vals, means, yerr=stds,
    fmt='none',
    ecolor='black',
    capsize=4,
    linewidth=1.2,
    zorder=2
)

# ===== 軸 =====
plt.xlabel('Imposed pressure (kPa)')
plt.ylabel('Nearest neighbor distance (µm)')
plt.xticks([0,10,20,30,40])

plt.tight_layout()
plt.show()